apple/darwin-xnu/bsd/man/man9/copy.9
.\"
.\" Copyright (c) 2008 Apple Inc.  All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_LICENSE_HEADER_END@
.\"
.\"
.\"	$NetBSD: copy.9,v 1.2 1996/01/09 03:23:04 thorpej Exp $
.\"
.\" Copyright (c) 1996 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed by Kenneth Stailey.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/copy.9,v 1.6.2.5 2001/12/17 11:30:18 ru Exp $
.\"
.Dd October 2, 2008
.Dt COPY 9
.Os
.Sh NAME
.Nm copy ,
.Nm copyin ,
.Nm copyinstr ,
.Nm copyout ,
.Nm copystr
.Nd kernel copy functions
.Sh SYNOPSIS
.In sys/types.h
.In sys/systm.h
.Ft int
.Fo copyin
.Fa "const void *uaddr"
.Fa "void *kaddr"
.Fa "size_t len"
.Fc
.Ft int
.Fo copyinstr
.Fa "const void *uaddr"
.Fa "void *kaddr"
.Fa "size_t len"
.Fa "size_t *done"
.Fc
.Ft int
.Fo copyout
.Fa "const void *kaddr"
.Fa "void *uaddr"
.Fa "size_t len"
.Fc
.\" .Ft int
.\" .Fn copyoutstr
.\" .Fa "const void *kaddr"
.\" .Fa "void *uaddr"
.\" .Fa "size_t len"
.\" .Fa "size_t *done"
.\" .Fc
.Ft int
.Fo copystr
.Fa "const void *kfaddr"
.Fa "void *kdaddr"
.Fa "size_t len"
.Fa "size_t *done"
.Fc
.Sh DESCRIPTION
The
.Nm
functions are designed to copy contiguous data from one address
to another.  All but
.Fn copystr
copy data from user-space to kernel-space or vice-versa.
.Pp
The
.Nm
routines provide the following functionality:
.Bl -tag -width "copyoutstr()"
.\" ========
.It Fn copyin
Copies
.Pa len
bytes of data from the user-space address
.Pa uaddr
to the kernel-space address
.Pa kaddr .
.\" ========
.It Fn copyinstr
Copies a NUL-terminated string, at most
.Pa len
bytes long, from user-space address
.Pa uaddr
to kernel-space address
.Pa kaddr .
The number of bytes actually copied, including the terminating
NUL, is returned in
.Pa *done .
.\" ========
.It Fn copyout
Copies
.Pa len
bytes of data from the kernel-space address
.Pa kaddr
to the user-space address
.Pa uaddr .
.\" ========
.\" .It Fn copyoutstr
.\" Copies a NUL-terminated string, at most
.\" bytes long, from kernel-space address
.\" .Pa kaddr
.\" to user-space address
.\" .Pa uaddr .
.\" The number of bytes actually copied, including the terminating
.\" NUL, is returned in
.\" .Pa *done .
.\" ========
.It Fn copystr
Copies a NUL-terminated string, at most
.Pa len
bytes long, from kernel-space address
.Pa kfaddr
to kernel-space address
.Pa kdaddr .
The number of bytes actually copied, including the terminating
NUL, is returned in
.Pa *done .
.El
.Sh RETURN VALUES
The
.Nm
functions return 0 on success or the following error on failure:
.\" ========
.Bl -tag -width Er
.It Bq EFAULT
If a bad address is encountered. When this error is returned, the contents of the destination buffer (
.Fa *kaddr
for
.Fn copyin ,
.Fn copyinstr ,
and
.Fn copystr ;
.Fa *uaddr
for
.Fn copyout )
are undefined. For
.Fn copyinstr
and
.Fn copystr ,
the contents of the
.Fa *done
parameter are also undefined on a return of EFAULT.
.El
.Pp
In addition to EFAULT,
.\" .Fn copystr ,
.\" .Fn copyinstr ,
.\" and
.\" .Fn copyoutstr
.Fn copystr
and
.Fn copyinstr
on failure will return:
.\" ========
.Bl -tag -width Er
.It Bq ENAMETOLONG
When the string is longer than
.Pa len
bytes. On this error return, the destination buffer is not null-terminated, but the
.Fa *done
parameter is maintained.
.EL
.Sh SEE ALSO
.Xr fetch 9 ,
.Xr store 9
